# -----------------------------------------------------------------
# str과 list 컨테이너 타입 / 순서있는 Sequence Type
# -----------------------------------------------------------------
# 순서 있는 Sequence Type
# - 원소/요소를 인덱스 식별
# - 덧셈, 곱셈, 맴버 연산자 동작 동일
# - 종류 : str, list, tuple, range ...
# -----------------------------------------------------------------

## 컨테이너간의 현변환
str = "Happy"

## str -> list 형변환
print(f'str => list 형변환 list("Good") : {list(str)}') # ['H', 'a', 'p', 'p', 'y']

## 형변환x, list 생성ㅇ
print(f'list => list 형변환 list(["Good"]) : {list([str])}') # ['Happy']

# -----------------------------------------------------------------
# 1개 str ==> 여러개 str 변화/분리 : split()
# -----------------------------------------------------------------

## 입력 2개 받기
nums = input("정수 2개 입력 ex) 10 30 : ")

# 패킹(Packing) : 여러개의 변수를 하나의 변수에
list = nums.split(" ")
num1 = list[0]
num2 = list[1]
print(nums)

# 언패킹(Unpacking) : 원소 수 만큼 변수 지정해서 저장
n1, n2 = nums.split() # 변수 개수와 원소가 같아야함
print(f'n1 : {n1} / n2 : {n2}')



