# --------------------------------------------------------------------------------------
# for ~ in 반복문 : 중첩 반복문
# --------------------------------------------------------------------------------------

## 9단 출력
for x in range(1,10):
    print(f'9 * {x} = {9*x : >2}')
print()

## 구구단 모두 출력
for x in range(2 , 10) :
    print(f'{x}단')
    for y in range(1, 10):
        print(f'{x} * {y} = {x * y}')
    print()    
        

## 홀수단만 출력
print("홀수단만 출력")
for x in range(3 , 10, 2) :
    print(f'{x}단')
    for y in range(1, 10):
        print(f'{x} * {y} = {x * y}')
    print()   