# -------------------------------------------------------
# if ~ else 조건문과 조건부표현식
# -------------------------------------------------------
# 조건부표현식 : 1줄 조건문
# - 형식 : True 실행 if 조건식 else False 실행
# -------------------------------------------------------

## 1. 짝수 홀수 출력하기
num = 3

if num%2 == 0:
    print("짝수")
else:
    print("홀수")



if num%2:
    print("홀수")
else:
    print("짝수")


## 조건부 표현식
print("짝수") if num%2==0 else print("홀수")
print("홀수") if num%2 else print("짝수")

res="짝수" if num%2==0 else "홀수"

res="양수" if num>0 else "음수" if num<0 else "0"
#   |---------(1)-----------|
#                       |---------(2)-----------|                 





