# -------------------------------------------------------
# 조건문
# -------------------------------------------------------
# 문제 8) 주민번호 입력 받아서 아래 내용대로 출력
#        0000년 0월 0일 생 00세
# -------------------------------------------------------

jumin = input("주민번호 입력(예: 000000-0000000) : ").strip()

## 년도 1 or 2 -> 1900 / 3 or 4 -> 2000

year =''
## 첫번째 방법
# if int(jumin[7]) < 3:
#     year = "19" + jumin[:2]

# elif int(jumin[7]) < 5 :
#     year = "20" + jumin[:2]


## 두번째 방법
# if jumin[7] in ['1', '2', '5', '6'] :
#     year = "19" + jumin[:2]
# elif jumin[7] in ['3', '4', '7', '8'] :
#     year = "20" + jumin[:2]
# else:
#     print("잘못된 형식입니다.")


## 세번째 방법
if jumin[7] in '1256' :
    year = "19" + jumin[:2]
elif jumin[7] in '3478' :
    year = "20" + jumin[:2]
else:
    print("잘못된 형식입니다.")

print(f'{year}년 {jumin[2:4]}월 {jumin[4:6]}일 {2025 - int(year) +1}세')