# -----------------------------------------------------------
# 객체비교 연산자 & 숫자관련 내장 함수들
# -----------------------------------------------------------
# 객체비교 연산자 : 동일한 객체 여부 비교
# - 종류 : is, is not
# - 결과 : True/False
# -----------------------------------------------------------
n1 = 10
n2 = 10

print(f'10 is 20 => {10 is 20}, id(10) : {id(10)}, id(20) : {id(20)}')
print(f'10 is 10.=> {10 is 10.}, id(10) : {id(10)}, id(10.) : {id(10.)}')
print(f'10 is 10 => {10 is 10}, id(10) : {id(10)}')
print(f'n1 is n2 : {n1 is n2}')

# -----------------------------------------------------------
# 숫자 관련된 내장함수들
# -----------------------------------------------------------
print(f'절대값 변환 함수 abs() : {abs(-0.4)}')
print(f'가장큰값 반환 max() : {max(1,2,3,4,5)}')
print(f'가장큰값 반환 max() : {max("abc", "abC")}')
print(f'가장작은값 반환 min() : {min(1,2,3,4,5)}')
print(f'합계 반환 sum() : {sum([1,2,3,4,5,6])}') # 리스트 형식으로 삽입
print(f'소수점 이하 처리 round(3.149271, 3) : {round(3.149271,3)}')
print(f'소수점 이하 처리 round(3.149271, 2) : {round(3.149271,2)}')
print(f'소수점 이하 처리 round(3.149271) : {round(3.149271)}')
print(f'소수점 이하 처리 round(3.5, 0) : {round(3.5,0)}')
