# ------------------------------------------------------------------
# 데이터 타입의 변환 / 형변환 / 타입 캐스팅 / 캐스팅
# ------------------------------------------------------------------

## int타입으로 형변화 : int() 생성자
print(f'"3"   => int 형변환   : {int("3"), type(int("3"))}')
print(f'3.    => int 형변환   : {int(3.)}')
print(f'True  => int 형변환   : {int(True)}') # True = 1 , false = 0
print(f'-9    => int 형변환   : {int(-9)}')
# print(f'"3."   => int 형변환 : {int("3.")}') # <- ERROR (str타입은 숫자만 변환 가능)
print(f'"-9"  => int 형변환   : {int("-9")}')

print()
# ------------------------------------------------------------------
# ?타입 ==> float 타입으로 형변환 : float() 생성자
# ------------------------------------------------------------------
print(f'-9    => float 형변환 : {float(-9)}')
print(f'True  => float 형변환 : {float(True)}')
print(f'"3.4" => float 형변환 : {float("3.4")}')


print()
# ------------------------------------------------------------------
# ?타입 ==> bool 타입으로 형변환 : bool() 생성자 
# ** 정수/실수 0, empty string 이 아니면 모두 True("0"도 True임)
# ------------------------------------------------------------------
print(f'-9    => bool 형변환  : {bool(-9)}')
print(f'.0    => bool 형변환  : {bool(.0)}')
print(f'"3.4" => bool 형변환  : {bool("3.4")}')
print(f'""    => bool 형변환  : {bool("")}')
