# -----------------------------------------------------------------
# Set 자료형 살펴보기
# - 컨테이너 타입 중 집합 타입 => 중복 불가!!!
# - 형식 : { data1, data2, ....}
# - 특징 : 순서x, 중복x, 인덱스x, 키x
# -----------------------------------------------------------------

## set 객체 생성
s1 = { } ## 주의!!dict 타입으로 인정됨
s1 = set() ## 빈 집합 생성
s2 = set({1,1,1,2,3})
s3 = {'A', False, 11, 4.3, 'A', 11, 11}
s4 = {'A', False, ('name', "age")}  ## 리스트(변경이 가능하기 때문) 안됨
# s3 = {'A', False, {'name': "age"} }  ## dict 안됨 (이하 동문)

print(f's1 => {type(s1)}, {len(s1)}개, {s1}')
print(f's2 => {type(s2)}, {len(s2)}개, {s2}')
print(f's3 => {type(s3)}, {len(s3)}개, {s3}')
print(f's4 => {type(s4)}, {len(s4)}개, {s4}')
