# -------------------------------------------
# 표준출력함수 - print()
# -------------------------------------------
## 기본기능: print(데이터)
#           pirnt(데이터1, 데이터2, ... 데이터n)

print("오늘은", "좋은날")
print("오늘은",2025, 9, 2, "화요일")

year = 2025
name = "홍길동"
print(year, name, "Good", 2025, id(2025), print(year)) # print() 함수는 반환값이 없어서 None 출력

# ------------------------------------------------------------
# 원하는 형식으로 출력 - print() 서식지정자 사용
# ------------------------------------------------------------
# => 서식지정자 : 어떤 종류의 데이터가 들어가는지 지정하는 문법
#                ex) %문자1개 : %d, %f, %s, %x
# ------------------------------------------------------------
a = 10
b = 5
c = 4.

print(a, "+", b , "=", a+b)

print("%d + %d = %d" %(a, b, a+b))

print("a+b=%d, a*b=%d" %(a+b, a*b))

## 출력 요청 : 10 + 5 + 4.0 = 19.0
print("%d + %d + %f = %f" %(a, b, c, a+b+c))
## => 자동 형변환
print("%s + %s + %s = %s" %(a, b, c, a+b+c)) # 소수점 자리는 자동정리


# ------------------------------------------------------------
# 원하는 형식으로 출력 - f-string 서식지정자 사용
# ------------------------------------------------------------
# => f-string : 문자열 내부에 서식이 설정된 문자열 의미
#                * 형식: f' {변수명}' OR f' {데이터}'
# ------------------------------------------------------------

## 출력 요청 : 10 + 5 + 4.0 = 19.0
print("f-string : ",f'{a} + {b} = {a+b}')

## f-string 변수명 --------------------------------------------
DATA_DIR = "data"
FILE_NAME = 'cat.jpg'

FILE_PATH = F'{DATA_DIR}/{FILE_NAME}'
print(FILE_PATH)



