# ------------------------------------------------------------------------------------------
# str 전용 메서드
# ------------------------------------------------------------------------------------------
# 문자열에서 특정 원소/요소 인덱스 찾는 메서드 : find(), index()
# ------------------------------------------------------------------------------------------

## find() : 없는 요소일 경우 -1 반환
## index() : 없는 요소일 경우 ERROR


data = "Good Good Good"
## 1) 두번째 G인덱스 출력
print(data.find("G", 1))
print(data[1:].find('G') + 1)

g_idx = data.find('G') # 첫번째 G 인덱스 저장
g_idx = data.find('G', g_idx+1) # 두번재 G 인덱스 저장
g_idx = data.find('G', g_idx+1) # 세번재 G 인덱스 저장

# ------------------------------------------------------------------------------------------
# rfind() : 없는 요소 -1 반환, 양수인덱스만 넘겨줌
# rindex() : 없는 요소 ERROR 반환, 양수 인덱스 반환
#           ==> 뒤에서 시작
# ------------------------------------------------------------------------------------------

print('마지막 G :', data.rindex('G'))


# ------------------------------------------------------------------------------------------
# count() : 지정된 원소가 str 안에 몇 개 있는지 반환
# ------------------------------------------------------------------------------------------
print('G의 개수는 :', data.count('G'))


# ------------------------------------------------------------------------------------------
# strip() : str의 앞부분과 끝부분의 공백을 제거해주는 메서드
# => lstrip() : 앞부분 공백 제거
# => rstrip() : 끝부분 공백 제거
# ------------------------------------------------------------------------------------------

data = "   오늘은 좋은 날!  "
data1 = data.strip()
data2 = data.lstrip()
data3 = data.rstrip()

print(f'{data} : {len(data)}개')
print(f'{data1} : {len(data1)}개')
print(f'{data2} : {len(data2)}개')
print(f'{data3} : {len(data3)}개')


# ------------------------------------------------------------------------------------------
# strip(문자열) : str의 앞부분과 끝부분의 지정 문자열을 제거해주는 메서드
# => lstrip(문자열) : 앞부분 지정 문자열 제거
# => rstrip(문자열) : 끝부분 지정 문자열 제거
# ------------------------------------------------------------------------------------------
data = 'Good! Good Luck!!'
print(f'{data} : {data.strip("!")}') ## 모두 없어짐
print(f'{data} : {data.strip("Go")}')

